rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/i2c/Esp32DriverI2C.c
/******************************************************************************
 * platforms/esp32/source/esp32/driver/i2c/Esp32DriverI2C.c
 *
 * This Source Code Form is subject to the terms of the Mozilla Public License, v. 2.0.
 * If a copy of the MPL was not distributed with this file, you can obtain one at
 * https://mozilla.org/MPL/2.0/.
 *
 * Copyright 2026, Roku, Inc.  All rights reserved.
 *
 * ESP32 hardware I²C master driver implementing the ILTDriverI2C interface.
 *
 * The ESP32 has two I²C controllers (port 0 and port 1).  Each is driven by a
 * command-list engine: the host loads up to 16 command slots, preloads TX bytes
 * into the hardware TX FIFO, then writes the TRANS_START bit.  The hardware
 * serialises START / WRITE / READ / STOP phases autonomously.  On completion
 * received bytes can be popped from the RX FIFO.  Transfers are polled
 * synchronously (no interrupt) which is correct for the low-traffic SCCB bus.
 *
 * TX and RX FIFOs are accessed through the AHB data bus window:
 *   I2C0: 0x6001301c   I2C1: 0x6002701c
 * Writing pushes a byte to the TX FIFO; reading pops a byte from the RX FIFO.
 *
 * Configuration keys read from LTDeviceConfig.json per unit:
 *   name  — logical bus name (e.g. "sccb")
 *   port  — hardware port number: 0 or 1
 *   sda   — GPIO number for SDA
 *   scl   — GPIO number for SCL
 *
 * Maximum payload per call: 30 bytes (TX or RX), matching the 32-byte FIFO
 * minus 1-2 bytes of address overhead.  SCCB writes are 3 bytes and reads
 * return 1 byte, well within this limit.
 *****************************************************************************/

#include <lt/core/LTCore.h>
#include <lt/core/LTTime.h>
#include <lt/core/LTStdlib.h>
#include <lt/device/i2c/LTDeviceI2C.h>
#include <lt/device/config/LTDeviceConfig.h>

#include "esp32/Esp32_Registers.h"
#include "esp32/Esp32_Clock.h"
#include "esp32/Esp32_GPIO.h"

DEFINE_LTLOG_SECTION("esp32.drv.i2c");

/* Instance state */
typedef struct {
    const char                *name;
    u8                         port;
    u8                         sdaGpio;
    u8                         sclGpio;
    u32                        nRefCount;
    LTMutex                   *mutex;
    LTDeviceI2C_Configuration  cfg;
    LTDeviceI2C_Capabilities   caps;
} I2C_Instance;

static struct {
    I2C_Instance *pInstances;
    u32           nCount;
} S;

/* =========================================================================
 * ESP32 I²C register file
 *
 * Peripheral base (through DPORT address space):
 *   I2C0: 0x3FF53000   I2C1: 0x3FF67000  (stride 0x14000)
 * ========================================================================= */

#define I2C_DPORT_BASE(port)    (0x3FF53000UL + (u32)(port) * 0x14000UL)
#define I2C_REG(port, off)      (*(volatile u32 *)(I2C_DPORT_BASE(port) + (off)))

/* AHB data-bus window for FIFO push/pop (different address decode from DPORT) */
#define I2C_FIFO_AHB(port)      ((volatile u32 *)(0x60013000UL + (u32)(port) * 0x14000UL + 0x001CUL))

/* Register offsets */
#define I2C_SCL_LOW_PERIOD_OFF   0x0000
#define I2C_CTR_OFF              0x0004
#define I2C_SR_OFF               0x0008
#define I2C_TO_OFF               0x000C
#define I2C_FIFO_CONF_OFF        0x0018
#define I2C_INT_RAW_OFF          0x0020
#define I2C_INT_CLR_OFF          0x0024
#define I2C_INT_ENA_OFF          0x0028
#define I2C_SDA_HOLD_OFF         0x0030
#define I2C_SDA_SAMPLE_OFF       0x0034
#define I2C_SCL_HIGH_PERIOD_OFF  0x0038
#define I2C_SCL_START_HOLD_OFF   0x0040
#define I2C_SCL_RSTART_SETUP_OFF 0x0044
#define I2C_SCL_STOP_HOLD_OFF    0x0048
#define I2C_SCL_STOP_SETUP_OFF   0x004C
#define I2C_SCL_FILTER_OFF       0x0050
#define I2C_SDA_FILTER_OFF       0x0054
#define I2C_COMD0_OFF            0x0058  /* command[0..15]: offsets 0x58, 0x5C … 0x94 */

/* CTR bits */
#define CTR_SDA_FORCE_OUT   (1u << 0)
#define CTR_SCL_FORCE_OUT   (1u << 1)
#define CTR_MS_MODE         (1u << 4)   /* 1 = master */
#define CTR_TRANS_START     (1u << 5)
#define CTR_CLK_EN          (1u << 8)

/* INT_RAW bits */
#define INT_TRANS_COMPLETE  (1u << 7)
#define INT_TIME_OUT        (1u << 8)
#define INT_ACK_ERR         (1u << 10)
#define INT_ARB_LOST        (1u << 5)

/* FIFO_CONF bits */
#define FIFO_RX_RST         (1u << 12)
#define FIFO_TX_RST         (1u << 13)

/* Command engine opcodes (op_code field at bits [13:11]) */
#define CMD_OP_RSTART   0u
#define CMD_OP_WRITE    1u
#define CMD_OP_READ     2u
#define CMD_OP_STOP     3u
#define CMD_OP_END      4u

#define CMD_ACK_EN      (1u << 8)   /* check ACK from slave during WRITE */
#define CMD_ACK_EXP     (1u << 9)   /* expected ACK value: 0 = ACK */
#define CMD_ACK_VAL     (1u << 10)  /* ACK to send after last READ byte: 1 = NACK */

/* APB clock is 80 MHz on all ESP32 variants */
#define APB_CLK_HZ      80000000UL

/* GPIO matrix signal indices for I²C (from soc/gpio_sig_map.h) */
#define I2C0_SDA_SIG    30u   /* I2CEXT0_SDA_IN_IDX / I2CEXT0_SDA_OUT_IDX */
#define I2C0_SCL_SIG    29u   /* I2CEXT0_SCL_IN_IDX / I2CEXT0_SCL_OUT_IDX */
#define I2C1_SDA_SIG    96u   /* I2CEXT1_SDA_IN_IDX / I2CEXT1_SDA_OUT_IDX */
#define I2C1_SCL_SIG    95u   /* I2CEXT1_SCL_IN_IDX / I2CEXT1_SCL_OUT_IDX */

/* =========================================================================
 * Instance state
 * ========================================================================= */

/* =========================================================================
 * Hardware helpers
 * ========================================================================= */

static void HwResetFifos(u8 port) {
    u32 c = I2C_REG(port, I2C_FIFO_CONF_OFF);
    I2C_REG(port, I2C_FIFO_CONF_OFF) = c | FIFO_RX_RST | FIFO_TX_RST;
    I2C_REG(port, I2C_FIFO_CONF_OFF) = c & ~(FIFO_RX_RST | FIFO_TX_RST);
}

static void HwClearInterrupts(u8 port) {
    I2C_REG(port, I2C_INT_ENA_OFF) = 0u;
    I2C_REG(port, I2C_INT_CLR_OFF) = 0x1FFFu;
}

static void HwConfigure(u8 port, u32 freq) {
    if (!freq) freq = 100000u;

    /* Half-period in APB clock counts, clamped to at least 1 */
    u32 half = APB_CLK_HZ / (2u * freq);
    if (!half) half = 1u;

    I2C_REG(port, I2C_SCL_LOW_PERIOD_OFF)   = half - 1u;
    I2C_REG(port, I2C_SCL_HIGH_PERIOD_OFF)  = half - 1u;
    I2C_REG(port, I2C_SDA_HOLD_OFF)         = half / 2u;
    I2C_REG(port, I2C_SDA_SAMPLE_OFF)       = half / 2u;
    I2C_REG(port, I2C_SCL_START_HOLD_OFF)   = half;
    I2C_REG(port, I2C_SCL_RSTART_SETUP_OFF) = half;
    I2C_REG(port, I2C_SCL_STOP_HOLD_OFF)    = half;
    I2C_REG(port, I2C_SCL_STOP_SETUP_OFF)   = half;

