rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/i2c/Esp32DriverI2C.c
    /* Timeout: 20-bit field, set to maximum (~13 ms at 80 MHz APB) */
    I2C_REG(port, I2C_TO_OFF) = 0xFFFFFu;

    /* Glitch filters: enabled with threshold = 7 APB clocks */
    I2C_REG(port, I2C_SCL_FILTER_OFF) = (1u << 3) | 7u;
    I2C_REG(port, I2C_SDA_FILTER_OFF) = (1u << 3) | 7u;

    /* Master mode, push-pull SCL/SDA output enables, clock gate on */
    I2C_REG(port, I2C_CTR_OFF) = CTR_SDA_FORCE_OUT | CTR_SCL_FORCE_OUT
                                | CTR_MS_MODE | CTR_CLK_EN;
}

static void HwConnectGpio(u8 port, u8 sdaPin, u8 sclPin) {
    u8 sdaSig = (port == 0u) ? (u8)I2C0_SDA_SIG : (u8)I2C1_SDA_SIG;
    u8 sclSig = (port == 0u) ? (u8)I2C0_SCL_SIG : (u8)I2C1_SCL_SIG;

    /* SDA: open-drain with pull-up; bidirectional through GPIO matrix */
    Esp32GPIO_ConfigPin(sdaPin, kEsp32GPIO_Direction_Input,
                        kEsp32GPIO_PullUp, kEsp32GPIO_Function_GPIO);
    Esp32GPIO_ConfigOutputType(sdaPin, kEsp32GPIO_OutputType_OpenDrain);
    Esp32GPIO_ConfigMatrixPin(sdaPin, sdaSig, kEsp32GPIO_Direction_Output, false);
    Esp32GPIO_ConfigMatrixPin(sdaPin, sdaSig, kEsp32GPIO_Direction_Input,  false);

    /* SCL: open-drain with pull-up; loopback input needed for clock-stretch */
    Esp32GPIO_ConfigPin(sclPin, kEsp32GPIO_Direction_Input,
                        kEsp32GPIO_PullUp, kEsp32GPIO_Function_GPIO);
    Esp32GPIO_ConfigOutputType(sclPin, kEsp32GPIO_OutputType_OpenDrain);
    Esp32GPIO_ConfigMatrixPin(sclPin, sclSig, kEsp32GPIO_Direction_Output, false);
    Esp32GPIO_ConfigMatrixPin(sclPin, sclSig, kEsp32GPIO_Direction_Input,  false);
}

/* Spin-poll until TRANS_COMPLETE or an error flag appears.
 * Returns true on success, false on timeout / ACK error / arbitration loss.
 * On error the FIFO is reset and the caller should re-establish config. */
/* Full hardware reset of an I2C port: disable clock, re-enable, reconfigure.
 * Called after timeout to recover from a bus stall (slave clock-stretching). */
static void HwFullReset(u8 port, u32 freq) {
    u32 clkBit = (port == 0u) ? kEsp32_Clock_I2C_EXT0 : kEsp32_Clock_I2C_EXT1;
    Esp32_ClockDisablePeripheralClock(clkBit);
    for (volatile u32 i = 0u; i < 200u; ++i) {}
    Esp32_ClockEnablePeripheralClock(clkBit);
    HwResetFifos(port);
    HwClearInterrupts(port);
    HwConfigure(port, freq);
}

static bool HwWaitDone(u8 port) {
    for (u32 i = 0u; i < 200000u; ++i) {
        u32 raw = I2C_REG(port, I2C_INT_RAW_OFF);
        if (raw & INT_TRANS_COMPLETE) {
            I2C_REG(port, I2C_INT_CLR_OFF) = raw;
            return true;
        }
        if (raw & (INT_ACK_ERR | INT_ARB_LOST)) {
            /* NACK or bus collision — bus recovers automatically after STOP */
            LTLOG("wait.err", "int_raw=0x%lx port=%lu", LT_Pu32(raw), LT_Pu32((u32)port));
            I2C_REG(port, I2C_INT_CLR_OFF) = raw;
            HwResetFifos(port);
            return false;
        }
        if (raw & INT_TIME_OUT) {
            /* Slave is clock-stretching — reset controller and let caller retry */
            LTLOG("wait.timeout", "port=%lu sr=0x%lx",
                LT_Pu32((u32)port), LT_Pu32(I2C_REG(port, I2C_SR_OFF)));
            HwFullReset(port, 100000u);
            return false;
        }
    }
    {
        LTLOG_YELLOWALERT("wait.spin", "port=%lu — no completion flag", LT_Pu32((u32)port));
        HwFullReset(port, 100000u);
    }
    return false;
}

/* Write one command-engine slot */
LT_INLINE void WriteCmd(u8 port, u8 slot, u32 cmd) {
    I2C_REG(port, I2C_COMD0_OFF + (u32)slot * 4u) = cmd;
}

LT_INLINE u32 MkWrite(u8 nBytes) {
    /* op=WRITE — SCCB does not always ACK, so don't check ACK */
    return ((u32)CMD_OP_WRITE << 11) | (u32)nBytes;
}

LT_INLINE u32 MkRead(u8 nBytes) {
    /* op=READ, NACK after the last byte so the slave releases SDA */
    return ((u32)CMD_OP_READ << 11) | CMD_ACK_VAL | (u32)nBytes;
}

/* =========================================================================
 * Core transfer engine
 *
 * SCCB (used by OV sensors) requires STOP between the register-address write
 * and the data read — it does not support repeated START for combined
 * write+read.  When both txBuf and rxBuf are provided we therefore run two
 * independent bus transactions: write-phase (with STOP), then read-phase
 * (with START+STOP).
 *
 * Single-phase (write-only or read-only) follows the issueStart/issueStop
 * flags from the caller.
 * ========================================================================= */

static bool RunPhase(u8 port, u8 addr,
                     void *rxBuf, u32 rxLen,
                     const void *txBuf, u32 txLen,
                     bool start, bool stop) {
    volatile u32 *fifo = I2C_FIFO_AHB(port);

    HwResetFifos(port);
    HwClearInterrupts(port);

    u8 slot = 0u;

    if (txBuf && txLen) {
        if (start)
            WriteCmd(port, slot++, (u32)CMD_OP_RSTART << 11);
        *fifo = (u32)((addr << 1u) | 0u);
        for (u32 i = 0u; i < txLen; ++i)
            *fifo = ((const u8 *)txBuf)[i];
        WriteCmd(port, slot++, MkWrite((u8)(txLen + 1u)));
    }

    if (rxBuf && rxLen) {
        if (start)
            WriteCmd(port, slot++, (u32)CMD_OP_RSTART << 11);
        *fifo = (u32)((addr << 1u) | 1u);
        WriteCmd(port, slot++, MkWrite(1u));
        WriteCmd(port, slot++, MkRead((u8)rxLen));
    }

    if (stop)
        WriteCmd(port, slot++, (u32)CMD_OP_STOP << 11);

    WriteCmd(port, slot, (u32)CMD_OP_END << 11);

    I2C_REG(port, I2C_CTR_OFF) |= CTR_TRANS_START;

    if (!HwWaitDone(port)) return false;

    if (rxBuf && rxLen) {
        for (u32 i = 0u; i < rxLen; ++i)
            ((u8 *)rxBuf)[i] = (u8)(*fifo & 0xFFu);
    }
    return true;
}

/* Retry a RunPhase up to maxRetries times on timeout (slave clock-stretching).
 * Each failure triggers HwFullReset (already done in HwWaitDone), then waits
 * a bit before re-attempting. */
static bool RunPhaseWithRetry(u8 port, u8 addr,
                              void *rxBuf, u32 rxLen,
                              const void *txBuf, u32 txLen,
                              bool start, bool stop) {
    for (u32 attempt = 0u; attempt < 5u; ++attempt) {
        if (RunPhase(port, addr, rxBuf, rxLen, txBuf, txLen, start, stop))
            return true;
        /* Brief delay before retry to let the sensor finish internal processing */
        for (volatile u32 w = 0u; w < 8000u; ++w) {}
    }
    return false;
}

