rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/i2c/Esp32DriverI2C.c
static bool DoTransfer(I2C_Instance *inst,
                       u8 addr,
                       void *rxBuf, u32 rxLen,
                       const void *txBuf, u32 txLen,
                       bool issueStart, bool issueStop) {
    u8 port = inst->port;

    /* SCCB write+read: two separate bus transactions (STOP between them). */
    if (txBuf && txLen && rxBuf && rxLen) {
        if (!RunPhaseWithRetry(port, addr, NULL, 0, txBuf, txLen, true, true))
            return false;
        return RunPhaseWithRetry(port, addr, rxBuf, rxLen, NULL, 0, true, true);
    }

    /* Single-phase: write-only or read-only */
    return RunPhaseWithRetry(port, addr, rxBuf, rxLen, txBuf, txLen, issueStart, issueStop);
}

/* =========================================================================
 * Instance init / shutdown
 * ========================================================================= */

static bool InitInstance(I2C_Instance *inst) {
    u32 clkBit = (inst->port == 0u) ? kEsp32_Clock_I2C_EXT0 : kEsp32_Clock_I2C_EXT1;
    Esp32_ClockEnablePeripheralClock(clkBit);
    HwResetFifos(inst->port);
    HwClearInterrupts(inst->port);
    HwConnectGpio(inst->port, inst->sdaGpio, inst->sclGpio);
    HwConfigure(inst->port, inst->cfg.Frequency);
    return true;
}

static void ShutdownInstance(I2C_Instance *inst) {
    u32 clkBit = (inst->port == 0u) ? kEsp32_Clock_I2C_EXT0 : kEsp32_Clock_I2C_EXT1;
    HwClearInterrupts(inst->port);
    Esp32_ClockDisablePeripheralClock(clkBit);
    Esp32GPIO_ClearPinConfig(inst->sdaGpio);
    Esp32GPIO_ClearPinConfig(inst->sclGpio);
    if (inst->mutex) {
        lt_destroyobject(inst->mutex);
        inst->mutex = NULL;
    }
}

/* =========================================================================
 * LTDeviceConfig parsing
 * ========================================================================= */

static bool ConfigureDeviceUnit(LTDeviceConfig *cfg, I2C_Instance *inst, u32 section) {
    if (!(inst->name = cfg->ReadString(section, "name"))) {
        LTLOG_REDALERT("cdu.name", NULL); return false;
    }
    u32 port = cfg->ReadInteger(section, "port");
    if (port > 1u) {
        LTLOG_REDALERT("cdu.port", "port must be 0 or 1"); return false;
    }
    inst->port    = (u8)port;
    inst->sdaGpio = (u8)cfg->ReadInteger(section, "sda");
    inst->sclGpio = (u8)cfg->ReadInteger(section, "scl");

    inst->caps.Freq_min  = 10000u;
    inst->caps.Freq_max  = 400000u;
    inst->caps.Caps_mask = (u8)(kLTDeviceI2C_Capability_Master
                              | kLTDeviceI2C_Capability_Hardware);

    inst->cfg.Frequency = 100000u;
    inst->cfg.Master    = true;
    inst->cfg.Dma       = false;
    inst->cfg.Async     = false;

    if (!(inst->mutex = lt_createobject(LTMutex))) {
        LTLOG_REDALERT("cdu.mutex", NULL); return false;
    }
    return true;
}

static bool ConfigureDeviceUnits(void) {
    if (S.nCount || S.pInstances) return false;
    LTDeviceConfig *cfg = lt_openlibrary(LTDeviceConfig);
    if (!cfg) { LTLOG_REDALERT("cdus.cfg", NULL); return false; }

    u32 driverSection = cfg->GetDriverSection("LTDeviceI2C", "Esp32DriverI2C");
    S.nCount = cfg->GetNumDeviceUnits(driverSection);
    if (!S.nCount) { lt_closelibrary(cfg); return true; }

    S.pInstances = lt_malloc(S.nCount * sizeof(I2C_Instance));
    if (!S.pInstances) {
        LTLOG_REDALERT("cdus.oom", NULL); lt_closelibrary(cfg); return false;
    }
    lt_memset(S.pInstances, 0, S.nCount * sizeof(I2C_Instance));

    for (u32 i = 0u; i < S.nCount; ++i) {
        u32 unitSection = cfg->GetDeviceUnitSectionAt(driverSection, i);
        if (!unitSection ||
            !ConfigureDeviceUnit(cfg, &S.pInstances[i], unitSection)) {
            LTLOG_REDALERT("cdus.unit", "failed unit %lu", LT_Pu32(i));
            lt_closelibrary(cfg);
            return false;
        }
    }
    lt_closelibrary(cfg);
    return true;
}

/* =========================================================================
 * Library init / fini
 * ========================================================================= */

define_LTDEVICE_DRIVER_IMPLEMENTATION(ILTDriverI2C, Esp32DriverI2C);

static bool Esp32DriverI2CImpl_LibInit(void) {
    S.pInstances = NULL;
    S.nCount     = 0u;
    if (!ConfigureDeviceUnits()) return false;
    for (u32 i = 0u; i < S.nCount; ++i) {
        if (!InitInstance(&S.pInstances[i])) {
            LTLOG_REDALERT("lib.init", "failed init unit %lu", LT_Pu32(i));
            return false;
        }
    }
    return true;
}

static void Esp32DriverI2CImpl_LibFini(void) {
    if (S.pInstances) {
        for (u32 i = S.nCount; i; --i)
            ShutdownInstance(&S.pInstances[i - 1u]);
        lt_free(S.pInstances);
        S.pInstances = NULL;
    }
    S.nCount = 0u;
}

/* =========================================================================
 * ILTDriverI2C implementation
 * ========================================================================= */

static ILTDriverI2C s_ILTDriverI2C;

static I2C_Instance *InstanceFromHandle(LTDeviceUnit hDevice) {
    I2C_Instance **pp = (I2C_Instance **)LT_GetCore()->ReserveHandlePrivateData(hDevice);
    I2C_Instance  *inst = NULL;
    if (pp) {
        inst = *pp;
        LT_GetCore()->ReleaseHandlePrivateData(hDevice, pp);
    }
    return inst;
}

static u32 Esp32DriverI2CImpl_GetNumDeviceUnits(void) { return S.nCount; }

static u32 Esp32DriverI2CImpl_GetBusIndexFromName(const char *busName) {
    for (u32 i = 0u; i < S.nCount; ++i) {
        if (lt_strcmp(busName, S.pInstances[i].name) == 0)
            return i;
    }
    return LT_U32_MAX;
}

static void OnDestroyHandle(LTHandle hDevice) {
    I2C_Instance *inst = InstanceFromHandle(hDevice);
    if (!inst) return;
    inst->mutex->API->Lock(inst->mutex);
    if (inst->nRefCount > 0u) --inst->nRefCount;
    inst->mutex->API->Unlock(inst->mutex);
}

static LTDeviceUnit Esp32DriverI2CImpl_CreateDeviceUnitHandle(u32 n) {
    if (n >= S.nCount) return 0;
    LTDeviceUnit hDevice = LT_GetCore()->CreateHandle(
        (LTInterface *)&s_ILTDriverI2C, sizeof(I2C_Instance *));
    if (!hDevice) return 0;
    bool ok = false;
    I2C_Instance **pp = (I2C_Instance **)LT_GetCore()->ReserveHandlePrivateData(hDevice);
    if (pp) {
        I2C_Instance *inst = *pp = &S.pInstances[n];
        inst->mutex->API->Lock(inst->mutex);
        ++inst->nRefCount;
        inst->mutex->API->Unlock(inst->mutex);
        ok = true;
        LT_GetCore()->ReleaseHandlePrivateData(hDevice, pp);
    }
    if (!ok) { lt_destroyhandle(hDevice); return 0; }
    return hDevice;
}

static bool Esp32DriverI2CImpl_GetDeviceCapabilities(
        LTDeviceUnit unit, LTDeviceI2C_Capabilities *pCaps) {
    I2C_Instance *inst = InstanceFromHandle(unit);
    if (!inst || !pCaps) return false;
    lt_memcpy(pCaps, &inst->caps, sizeof(LTDeviceI2C_Capabilities));
    return true;
}

static bool Esp32DriverI2CImpl_GetDeviceConfiguration(
        LTDeviceUnit unit, LTDeviceI2C_Configuration *pCfg) {
    I2C_Instance *inst = InstanceFromHandle(unit);
    if (!inst || !pCfg) return false;
    lt_memcpy(pCfg, &inst->cfg, sizeof(LTDeviceI2C_Configuration));
    return true;
}

