rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/i2c/Esp32DriverI2C.c
static bool Esp32DriverI2CImpl_SetDeviceConfiguration(
        LTDeviceUnit unit, const LTDeviceI2C_Configuration *pCfg) {
    I2C_Instance *inst = InstanceFromHandle(unit);
    if (!inst || !pCfg) return false;
    if (!I2C_CONFIG_CAPS_OK(pCfg, &inst->caps)) {
        LTLOG_YELLOWALERT("cfg.caps", "freq=%lu out of range", LT_Pu32(pCfg->Frequency));
        return false;
    }
    lt_memcpy(&inst->cfg, pCfg, sizeof(LTDeviceI2C_Configuration));
    HwConfigure(inst->port, inst->cfg.Frequency);
    return true;
}

static void Esp32DriverI2CImpl_SetTransferTimeout(LTDeviceUnit unit, LTTime timeout) {
    LT_UNUSED(unit);
    LT_UNUSED(timeout);
}

static bool Esp32DriverI2CImpl_I2CMasterTransfer(
        LTDeviceUnit unit, u8 addr,
        void *rxBuf, u32 rxLen,
        const void *txBuf, u32 txLen,
        bool issueStart, bool issueStop,
        LTI2C_I2CMasterTransferStatusCallback *pCallback, void *pClientData) {
    LT_UNUSED(pCallback);
    LT_UNUSED(pClientData);

    I2C_Instance *inst = InstanceFromHandle(unit);
    if (!inst) return false;
    if (!rxLen && !txLen) return false;

    /* Payload guard: TX FIFO is 32 bytes; we need up to 2 bytes for address */
    if (txLen > 30u || rxLen > 30u) {
        LTLOG_REDALERT("xfer.oversize", "tx=%lu rx=%lu", LT_Pu32(txLen), LT_Pu32(rxLen));
        return false;
    }

    inst->mutex->API->Lock(inst->mutex);
    bool ok = DoTransfer(inst, addr, rxBuf, rxLen, txBuf, txLen, issueStart, issueStop);
    inst->mutex->API->Unlock(inst->mutex);
    return ok;
}

static bool Esp32DriverI2CImpl_Reset(LTDeviceUnit unit) {
    I2C_Instance *inst = InstanceFromHandle(unit);
    if (!inst) return false;
    inst->mutex->API->Lock(inst->mutex);
    HwResetFifos(inst->port);
    HwClearInterrupts(inst->port);
    HwConfigure(inst->port, inst->cfg.Frequency);
    inst->mutex->API->Unlock(inst->mutex);
    return true;
}

static bool Esp32DriverI2CImpl_ProbeAddress(LTDeviceUnit unit, u8 addr) {
    I2C_Instance *inst = InstanceFromHandle(unit);
    if (!inst) return false;

    inst->mutex->API->Lock(inst->mutex);

    u8  port = inst->port;
    volatile u32 *fifo = I2C_FIFO_AHB(port);

    HwResetFifos(port);
    HwClearInterrupts(port);

    /* START + WRITE(addr|W, 1 byte) + STOP — ACK = device present */
    *fifo = (u32)((addr << 1u) | 0u);
    WriteCmd(port, 0, (u32)CMD_OP_RSTART << 11);
    WriteCmd(port, 1, MkWrite(1u));
    WriteCmd(port, 2, (u32)CMD_OP_STOP << 11);
    WriteCmd(port, 3, (u32)CMD_OP_END << 11);

    I2C_REG(port, I2C_CTR_OFF) |= CTR_TRANS_START;
    bool present = HwWaitDone(port);

    inst->mutex->API->Unlock(inst->mutex);

    LTLOG_DEBUG("probe", "addr=0x%lx %s",
        LT_Pu32((u32)addr), present ? "ACK" : "NACK");
    return present;
}

/* =========================================================================
 * Interface and library root binding
 * ========================================================================= */

define_LTLIBRARY_INTERFACE(ILTDriverI2C, OnDestroyHandle) {
    .GetBusIndexFromName    = Esp32DriverI2CImpl_GetBusIndexFromName,
    .GetDeviceCapabilities  = Esp32DriverI2CImpl_GetDeviceCapabilities,
    .GetDeviceConfiguration = Esp32DriverI2CImpl_GetDeviceConfiguration,
    .SetDeviceConfiguration = Esp32DriverI2CImpl_SetDeviceConfiguration,
    .SetTransferTimeout     = Esp32DriverI2CImpl_SetTransferTimeout,
    .I2CMasterTransfer      = Esp32DriverI2CImpl_I2CMasterTransfer,
    .Reset                  = Esp32DriverI2CImpl_Reset,
    .ProbeAddress           = Esp32DriverI2CImpl_ProbeAddress,
} LTLIBRARY_DEFINITION;

LTLIBRARY_EXPORT_INTERFACES(Esp32DriverI2C, (ILTDriverI2C))

/******************************************************************************
 *  LOG
 ******************************************************************************
 *  02-Jun-26   created — hardware I²C master for ESP32-CAM SCCB bus
 */
